import img_1 from '../assets/img/1.jpg';
import img_2 from '../assets/img/2.jpg';
import img_3 from '../assets/img/3.png';
import img_4 from '../assets/img/4.png';
import img_5 from '../assets/img/5.jpg';
import img_6 from '../assets/img/6.png';

export const articles = 
[
    {title:'دوندرز چیست؟',explain:'اگر شنیده اید که پایتونیستای باتجربه در مورد پایتون صحبت می کنند یاچند سخنرانی کنفرانس را تماشا کرده اید که ممکن است اصطلاح dunder را شنیده باشید',img:img_1},
    {title: 'مدیران زمینه و با بیانیه',explain:'دستور with در پایتون به عنوان یک ویژگی مبهم در نظر گرفته می شود مقداری. اما وقتی به پشت صحنه نگاه می کنید، خواهید دید که هیچ وجود ندارد جادو.',img:img_5},
    {title:'ترفندهای پایتون',explain:'ترفندهای پایتون به عنوان یک سری کوتاه از اسکرین شات های کد شروع شد که منبه مدت یک هفته در توییتر به اشتراک گذاشته شد. در کمال تعجب، آنها',img:img_2},
    {title:'پایتون چیست?',explain:' این زبان برنامه نویسی روش های بسیار قدرتمند و حرفه‌ای را برای کار با زبان ها و ابزارهای مختلف به آسانی برای شما فراهم می کند و به همین دلیل',img:img_3},
    {title:'اینترنت و اینترنت اشیا',explain:'اینترنت محبوب ترین شبکه کامپیوتری دنیا است که ابتدا به شکل یک پروژه تحقیقاتی آکادمیک در سال ۱۹۶۹ شروع و سپس در دهه ۱۹۹۰ میلادی به یک شبکه جهانی',img:img_4},
    {title:'قرار دادن کاما از خود راضی در پایتون',explain:'در اینجا یک نکته مفید برای زمانی که در حال افزودن و حذف موارد از آن هستید، وجود دارد یک لیست، دیکت یا تنظیم ثابت در پایتون: فقط تمام خطوط',img:img_6},
]



export const text = `اگر شنیده اید که پایتونیستای باتجربه در مورد پایتون صحبت می کنند یا
چند سخنرانی کنفرانس را تماشا کرده اید که ممکن است اصطلاح dunder را شنیده باشید.اگر می‌پرسید این چیست، خوب، پاسخ شما در اینجا است:
زیرخط های دوگانه اغلب در پایتون به عنوان “داندر” شناخته می شوند
انجمن. دلیل آن این است که زیرخط های دوتایی اغلب ظاهر می شوند
در کد پایتون، و برای جلوگیری از خستگی عضلات فک خود، Pythonistas
غالباً «زیر خط دوگانه» را به «داندر» کوتاه می‌کنند.به عنوان مثال، شما baz را به عنوان “dunder baz” تلفظ می کنید. به همین ترتیب، init به عنوان “dunder init” تلفظ می شود، حتی اگر یک ممکن است فکر کند که باید “dunder init dunder” باشد. اما این فقط یکی دیگر از ابهامات در کنوانسیون نامگذاری است. مانند یک است دست دادن مخفی برای توسعه دهندگان پایتون دو خط پیشرو و انتهایی: “__var“شاید تعجب آور باشد که اگر نامی شروع شود، مخفی کردن نام اعمال نمی شود
و با زیرخط دوتایی به پایان می رسد. متغیرهایی که توسط یک دوتایی احاطه شده اند
پیشوند و پسوند زیر خط توسط مترجم پایتون آسیبی نبینند
class PrefixPostfixTest:
def init(self):
self.bam = 42

 PrefixPostfixTest().bam
42
با این حال، نام‌هایی که دارای دو امتیاز دوبل پیشرو و انتهایی هستند، برای استفاده ویژه در زبان محفوظ هستند. این قانون پوشش می دهد
چیزهایی مانند init برای سازنده شی، یا call برای فراخوانی اشیاء.
این روش‌های دوندر اغلب به عنوان روش‌های جادویی شناخته می‌شوند – اما
بسیاری از افراد در جامعه پایتون، از جمله من، دوست ندارند
آن کلمه به این معنی است که استفاده از روش‌های dunder ممنوع است،
که کاملاً اینطور نیست. آنها یک ویژگی اصلی در پایتون هستند و
باید در صورت نیاز استفاده شود. هیچ چیز “جادویی” یا مخفیانه ای در مورد آن وجود ندارد
آنها را
با این حال، تا آنجا که قراردادهای نامگذاری پیش می رود، بهتر است از آن دوری کنید
از نام‌هایی استفاده کنید که با زیرخط‌های دوتایی شروع و پایان می‌یابند
برنامه هایی برای جلوگیری از برخورد با تغییرات آتی در زبان پایتون.
زیر خط تکی: “” طبق قرارداد، گاهی اوقات از یک خط زیر خط مستقل استفاده می شود نامی برای نشان دادن موقتی یا ناچیز بودن یک متغیر. به عنوان مثال، در حلقه زیر نیازی به دسترسی به اجرا نداریم ایندکس و ما می توانیم از “” برای نشان دادن اینکه فقط یک مقدار موقت است استفاده کنیم:
for _ in range(32):
… print(‘Hello, World.’)
همچنین می‌توانید از زیرخط‌های منفرد در بازکردن عبارات به‌عنوان متغیر «مراقب نباشید» برای نادیده گرفتن مقادیر خاص استفاده کنید. باز هم این معنی
فقط طبق قرارداد است و هیچ رفتار خاصی را در آن ایجاد نمی کند
تجزیه کننده پایتون زیرخط تنها یک متغیر معتبر است
نامی که گاهی برای این منظور استفاده می شود`;



export const keyWord = ['نهال آی تی*خرید قالب وردپرس*خرید قالب Html*خرید قالب*سئو سایت*قالب سایت رایگان*طراحی لوگو *طراحی موشن گرافیک* طراحی کارت ویزیت*طراحی بنر','طراحی کارت ویزیت','طراحی موشن گرافیک','طراحی لوگو','قالب سایت','قالب آماده','قالب سایت رایگان','قالب وردپرس','نهال آی تی','طراحی بنر','خرید قالب Html','قالب سایت','نهال آی تی']